# Normalising SQL Tables
© Explore Data Science Academy

## Learning Objectives

In this train, you will learn:
- The differences between database normal forms; and
- How to use SQL queries to transform a table to different normal forms. 

## Outline

In this train, we'll go through the following: 
- What is normalisation?
- First Normal Form (1 NF).
- Second Normal Form (2 NF).
- Third Normal Form (3 NF).
- Case Study: Dam levels data
- Denormalization

## 1. What is normalisation?
Normalization is a database technique for evaluating and reorganizing table structures to minimize redundancies, improve data integrity, improve storage efficiency, and reduce the need to re-design the database if new data is introduced. Database normalization removes inconsistencies which may cause the analysis of our data to be more complicated. These inconsistencies could come from updating records, inserting, or deleting records. It also includes the removal of duplicate records which saves on storage, and is a step toward fulfilling the requirement of records having unique identifiers called keys.

Normalization is segmented into ordered categories: 1NF, 2NF, 3NF, BCNF, and 4NF.
2NF is preferred to 1NF, 3NF to 2NF, etc:

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/normalisation/normalisation.png" width=80% align="center"/>

## 2. First Normal Form (1 NF)

A table is in 1NF if it contains no repeating groups. To convert an unnormalised table to 1NF either:
- Flatten the table and change the primary key
- Decompose the table into smaller tables, one for the repeating groups and one for the non-repeating groups.

For example: 

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/normalisation/inf_before.png" width=80% align="center"/>

To resolve the repeating group anomaly, we can split into multiple rows or multiple tables:

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/normalisation/inf_after.png" width=80% align="center"/>

## 3. Second Normal Form (2 NF)

A table is in 2NF if it contains no repeating groups and no partial functional dependencies. To convert a relation with partial functional dependencies to 2NF, create a set of new relations:
- One relation for the attributes that are fully dependent upon the key.
- One relation for each part of the key that has partially dependent attributes.

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/normalisation/2nf_before.png" width=40% align="center"/>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/normalisation/2nf_after.png" width=80% align="center"/>

## 4. Third Normal Form (3 NF)
A table is in 3NF if it contains no repeating groups, no partial functional dependencies, and no transitive functional dependencies. To convert a relation with transitive functional dependencies to 3NF:
- Remove the attributes involved in the transitive dependency and put them in a new relation.
- Ensure that in a normalised relation a non-key field must provide a fact about the key, the whole key and nothing but the key.
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/normalisation/3nf_before.png" width=40% align="center"/>

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/normalisation/3nf_after.png" width=80% align="center"/>

Relations in 3NF are sufficient for most practical database design problems. However, 3NF does not guarantee that all anomalies have been removed. 

In this regard, delving into [Boyce-Codd normal form](https://en.wikipedia.org/wiki/Boyce%E2%80%93Codd_normal_form) (BCNF) and [4th normal form](https://en.wikipedia.org/wiki/Fourth_normal_form) (4NF) is beyond the scope of this course, but is recommended for eager learners who have an interest in data architecting.

## 5. Case Study: Dam levels data

In this section, we will look at normalising the dams database - a [flat-file database](https://en.wikipedia.org/wiki/Flat-file_database) containing information about Cape Town dam water levels leading up to the 2018 Cape Town water crisis. 

Note: Make sure that you download the dam_levels.db file from Athena, before continuing with the train. Since the queries here will modify the database, you will have to get a fresh copy to redo the following code cells.  

Load SQL magics and database:

In [1]:
%load_ext sql
# Load SQLite database
%sql sqlite:///dam_levels.db

Traceback (most recent call last):
  File "/home/thembajsph/anaconda3/lib/python3.9/site-packages/sql/magic.py", line 203, in execute
    conn.internal_connection.rollback()
AttributeError: 'Connection' object has no attribute 'rollback'

Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys(['sqlite:///dam_levels.db'])


Before we proceed, let's first take a closer look at the dam_levels table:

In [2]:
%%sql

SELECT *
FROM dam_levels

 * sqlite:///dam_levels.db
Done.

[('2012', 'WEMMERSHOEK', 'P. M. Naidoo', '201013', '48.2', '-33.826246', '19.091828'),
 ('2012', 'STEENBRAS LOWER;STEENBRAS UPPER', 'V. Mokere', '201124', '20.3;24.2', '-34.180527;-34.166702', '18.866688;18.90976'),
 ('2012', 'VOËLVLEI', 'A. T. Sijovu', '202256', '15', '-33.34178', '19.04105'),
 ('2012', 'HELY-HUTCHINSON', 'P. M. Naidoo', '201013', '14.2', '-33.976929', '18.409568'),
 ('2012', 'WOODHEAD', 'A. T. Sijovu', '202256', '35.3', '-33.977341', '18.404046'),
 ('2013', 'WEMMERSHOEK', 'P. M. Naidoo', '201013', '53.3', '-33.826246', '19.091828'),
 ('2013', 'STEENBRAS LOWER;STEENBRAS UPPER', 'V. Mokere', '201124', '22.4;24.6', '-34.180527;-34.166702', '18.866688;18.90976'),
 ('2013', 'VOËLVLEI', 'A. T. Sijovu', '202256', '16.6', '-33.34178', '19.04105'),
 ('2013', 'HELY-HUTCHINSON', 'P. M. Naidoo', '201013', '15.2', '-33.976929', '18.409568'),
 ('2013', 'WOODHEAD', 'A. T. Sijovu', '202256', '35.9', '-33.977341', '18.404046'),
 ('2015', 'WEMMERSHOEK', 'P. M. Naidoo', '201013', '47.5', '-33.826246', '19.091828'),
 ('2015', 'STEENBRAS LOWER;STEENBRAS UPPER', 'V. Mokere', '201124', '22.7;24.6', '-34.180527;-34.166702', '18.866688;18.90976'),
 ('2015', 'VOËLVLEI', 'A. T. Sijovu', '202256', '11.9', '-33.34178', '19.04105'),
 ('2015', 'HELY-HUTCHINSON', 'P. M. Naidoo', '201013', '15.3', '-33.976929', '18.409568'),
 ('2015', 'WOODHEAD', 'A. T. Sijovu', '202256', '36.1', '-33.977341', '18.404046')]

The table seems to contain recurring assessments and related information for each dam. The table also has some data anomalies. Let's try to resolve these using normalisation. 

### 5.1. First Normal Form (1 NF)
To get the table in **1 NF** we need to ensure that:
- 1. Each column contains the same datatype &#x2611;   
- 2. There are no repeating groups &#9746; - this can be resolved by separating the grouped data into multiple rows
- 3. Each row is uniquely identifiable &#9746; - this can be resolved by adding a primary key column

To resolve the repeating groups, we first isolate the offending rows of data:

In [3]:
%%sql
SELECT * 
FROM dam_levels
WHERE Assessment_Officer = "V. Mokere"

 * sqlite:///dam_levels.db
Done.

[('2012', 'STEENBRAS LOWER;STEENBRAS UPPER', 'V. Mokere', '201124', '20.3;24.2', '-34.180527;-34.166702', '18.866688;18.90976'),
 ('2013', 'STEENBRAS LOWER;STEENBRAS UPPER', 'V. Mokere', '201124', '22.4;24.6', '-34.180527;-34.166702', '18.866688;18.90976'),
 ('2015', 'STEENBRAS LOWER;STEENBRAS UPPER', 'V. Mokere', '201124', '22.7;24.6', '-34.180527;-34.166702', '18.866688;18.90976')]

It seems that data for two dams has been lumped together in the same rows.We'll copy this data, delete these rows in the table, and re-insert them (properly this time). 

Deleting the repeating group rows:

In [4]:
%%sql
DELETE 
FROM dam_levels
WHERE Assessment_Officer = "V. Mokere";

 * sqlite:///dam_levels.db
3 rows affected.

[]

Re-insert deleted rows of data:

In [5]:
%%sql

INSERT INTO dam_levels (year,dam_name,Assessment_Officer,Officer_Reg,water_level,dam_latitude,dam_longitude)
VALUES 
    ( 2012,"STEENBRAS LOWER","V. Mokere",201124,20.3,-34.180527,18.866688),
    ( 2012,"STEENBRAS UPPER","V. Mokere",201124,24.2,-34.166702,18.90976),
    ( 2013,"STEENBRAS LOWER","V. Mokere",201124,22.4,-34.180527,18.866688),
    ( 2013,"STEENBRAS UPPER","V. Mokere",201124,24.6,-34.166702,18.90976),
    ( 2015,"STEENBRAS LOWER","V. Mokere",201124,22.7,-34.180527,18.866688),
    ( 2015,"STEENBRAS UPPER","V. Mokere",201124,24.6,-34.16670,18.90976);

 * sqlite:///dam_levels.db
6 rows affected.

[]

Let's see if this worked:

In [6]:
%%sql
SELECT * 
FROM dam_levels

 * sqlite:///dam_levels.db
Done.

[('2012', 'WEMMERSHOEK', 'P. M. Naidoo', '201013', '48.2', '-33.826246', '19.091828'),
 ('2012', 'VOËLVLEI', 'A. T. Sijovu', '202256', '15', '-33.34178', '19.04105'),
 ('2012', 'HELY-HUTCHINSON', 'P. M. Naidoo', '201013', '14.2', '-33.976929', '18.409568'),
 ('2012', 'WOODHEAD', 'A. T. Sijovu', '202256', '35.3', '-33.977341', '18.404046'),
 ('2013', 'WEMMERSHOEK', 'P. M. Naidoo', '201013', '53.3', '-33.826246', '19.091828'),
 ('2013', 'VOËLVLEI', 'A. T. Sijovu', '202256', '16.6', '-33.34178', '19.04105'),
 ('2013', 'HELY-HUTCHINSON', 'P. M. Naidoo', '201013', '15.2', '-33.976929', '18.409568'),
 ('2013', 'WOODHEAD', 'A. T. Sijovu', '202256', '35.9', '-33.977341', '18.404046'),
 ('2015', 'WEMMERSHOEK', 'P. M. Naidoo', '201013', '47.5', '-33.826246', '19.091828'),
 ('2015', 'VOËLVLEI', 'A. T. Sijovu', '202256', '11.9', '-33.34178', '19.04105'),
 ('2015', 'HELY-HUTCHINSON', 'P. M. Naidoo', '201013', '15.3', '-33.976929', '18.409568'),
 ('2015', 'WOODHEAD', 'A. T. Sijovu', '202256', '36.1', '-33.977341', '18.404046'),
 ('2012', 'STEENBRAS LOWER', 'V. Mokere', '201124', '20.3', '-34.180527', '18.866688'),
 ('2012', 'STEENBRAS UPPER', 'V. Mokere', '201124', '24.2', '-34.166702', '18.90976'),
 ('2013', 'STEENBRAS LOWER', 'V. Mokere', '201124', '22.4', '-34.180527', '18.866688'),
 ('2013', 'STEENBRAS UPPER', 'V. Mokere', '201124', '24.6', '-34.166702', '18.90976'),
 ('2015', 'STEENBRAS LOWER', 'V. Mokere', '201124', '22.7', '-34.180527', '18.866688'),
 ('2015', 'STEENBRAS UPPER', 'V. Mokere', '201124', '24.6', '-34.1667', '18.90976')]

Success!

Next, we need to make sure that the rows are uniquely identifiable. The easiest way to achieve this is to add an ID column to the table. However, SQLite does not allow for the addition of constrained columns to existing tables. As such, we are better off creating a new table with the new ID column, copying the old columns across, and deleting the old table.

Create the new table structure:

In [7]:
%%sql

CREATE TABLE dam_levels_1nf (
    AssessmentId INTEGER PRIMARY KEY AUTOINCREMENT,
    year INTEGER,
    dam_name VARCHAR(100),
    Assessment_Officer VARCHAR(100),
    Officer_Reg INTEGER,
    water_level NUMERIC(10,1),
    dam_latitude NUMERIC(3,6),
    dam_longitude NUMERIC(3,6)
);

 * sqlite:///dam_levels.db
Done.

[]

Next, insert data from the old `dam_levels` table into the new `dam_levels_1nf` table:

In [8]:
%%sql 

INSERT INTO dam_levels_1nf(year, dam_name, Assessment_Officer, Officer_Reg, water_level, dam_latitude, dam_longitude)
SELECT year, dam_name, Assessment_Officer, Officer_Reg, water_level, dam_latitude, dam_longitude
FROM dam_levels
ORDER BY year;

 * sqlite:///dam_levels.db
18 rows affected.

[]

Let's do a sanity check:

In [9]:
%%sql

SELECT *
FROM dam_levels_1nf;

 * sqlite:///dam_levels.db
Done.

[(1, 2012, 'WEMMERSHOEK', 'P. M. Naidoo', 201013, 48.2, -33.826246, 19.091828),
 (2, 2012, 'VOËLVLEI', 'A. T. Sijovu', 202256, 15, -33.34178, 19.04105),
 (3, 2012, 'HELY-HUTCHINSON', 'P. M. Naidoo', 201013, 14.2, -33.976929, 18.409568),
 (4, 2012, 'WOODHEAD', 'A. T. Sijovu', 202256, 35.3, -33.977341, 18.404046),
 (5, 2012, 'STEENBRAS LOWER', 'V. Mokere', 201124, 20.3, -34.180527, 18.866688),
 (6, 2012, 'STEENBRAS UPPER', 'V. Mokere', 201124, 24.2, -34.166702, 18.90976),
 (7, 2013, 'WEMMERSHOEK', 'P. M. Naidoo', 201013, 53.3, -33.826246, 19.091828),
 (8, 2013, 'VOËLVLEI', 'A. T. Sijovu', 202256, 16.6, -33.34178, 19.04105),
 (9, 2013, 'HELY-HUTCHINSON', 'P. M. Naidoo', 201013, 15.2, -33.976929, 18.409568),
 (10, 2013, 'WOODHEAD', 'A. T. Sijovu', 202256, 35.9, -33.977341, 18.404046),
 (11, 2013, 'STEENBRAS LOWER', 'V. Mokere', 201124, 22.4, -34.180527, 18.866688),
 (12, 2013, 'STEENBRAS UPPER', 'V. Mokere', 201124, 24.6, -34.166702, 18.90976),
 (13, 2015, 'WEMMERSHOEK', 'P. M. Naidoo', 201013, 47.5, -33.826246, 19.091828),
 (14, 2015, 'VOËLVLEI', 'A. T. Sijovu', 202256, 11.9, -33.34178, 19.04105),
 (15, 2015, 'HELY-HUTCHINSON', 'P. M. Naidoo', 201013, 15.3, -33.976929, 18.409568),
 (16, 2015, 'WOODHEAD', 'A. T. Sijovu', 202256, 36.1, -33.977341, 18.404046),
 (17, 2015, 'STEENBRAS LOWER', 'V. Mokere', 201124, 22.7, -34.180527, 18.866688),
 (18, 2015, 'STEENBRAS UPPER', 'V. Mokere', 201124, 24.6, -34.1667, 18.90976)]

Finally, let's delete the redundant table:

In [10]:
%%sql

DROP TABLE dam_levels;

 * sqlite:///dam_levels.db
Done.

[]

and with that, we finally have a table in **1 NF**!

### 5.2. Second Normal Form (2 NF)

To get the table in **2 NF** we need to ensure that:
- 1. The table is in **1 NF** &#x2611;   
- 2. All partial functional dependencies should be removed &#9746; - all non-key columns should depend on the key column, anything else should be placed in a separate table. Looking at the table, we can notice two distinct entities, assessments and dam information. 

As such, we need to create two tables:
  1. **assessments** - with columns: `AssessmentId`, `year`, `Assessment_Officer`, `Officer_Reg`, `water_level`
  2. **dams** - with columns: `dam_name`, `dam_latitude`, `dam_longitude`

Let's go ahead and create the assessments table:

In [11]:
%%sql 

CREATE TABLE assessments (
    AssessmentId INTEGER PRIMARY KEY AUTOINCREMENT,
    year INTEGER,
    Assessment_Officer VARCHAR(100),
    Officer_Reg INTEGER,
    water_level NUMERIC(10,1)
);

 * sqlite:///dam_levels.db
Done.

[]

Copy relevant data into the `assessments` table from `dam_levels_1nf`:

In [12]:
%%sql

INSERT INTO assessments(AssessmentId, year, Assessment_Officer, Officer_Reg, water_level)
SELECT AssessmentId, year, Assessment_Officer, Officer_Reg, water_level
FROM dam_levels_1nf
ORDER BY year;

 * sqlite:///dam_levels.db
18 rows affected.

[]

With that completed, we now create the dams table:

In [13]:
%%sql

CREATE TABLE dams (
    dam_name VARCHAR(100),
    dam_latitude NUMERIC(3,6),
    dam_longitude NUMERIC(3,6)
);

 * sqlite:///dam_levels.db
Done.

[]

Copy relevant data into the `dams` table from `dam_levels_1nf`:

In [14]:
%%sql

INSERT INTO dams(dam_name, dam_latitude, dam_longitude)
SELECT dam_name, dam_latitude, dam_longitude
FROM dam_levels_1nf
GROUP BY dam_name;

 * sqlite:///dam_levels.db
6 rows affected.

[]

At this point, we've created two tables, the *assessments*, and the *dams* tables. However, the assessments and dam information are no longer linked, i.e. we don't know which assessment belongs to which dam. As such, we'll need to create a junction table (i.e. a linking table, in this case, a table that connects an assessment to a dam). 

To make a valid junction table, we'll need primary keys from both tables:

We'll use the `AssessmentId` from the assessments table, and the `dam_name` from the dams table.

Create junction table:

In [15]:
%%sql 

CREATE TABLE dam_assessments (
    AssessmentId INTEGER PRIMARY KEY AUTOINCREMENT,
    dam_name VARCHAR(100)
);

 * sqlite:///dam_levels.db
Done.

[]

Insert data into the dam_assessments table we just created:

In [16]:
%%sql

INSERT INTO dam_assessments (AssessmentId,dam_name)
VALUES 

    (1 	, "WEMMERSHOEK"), 
    (2 	, "VOËLVLEI"),
    (3 	, "HELY-HUTCHINSON"),
    (4 	, "WOODHEAD"), 
    (5 	, "STEENBRAS LOWER"), 
    (6 	, "STEENBRAS UPPER"), 
    (7 	, "WEMMERSHOEK"), 
    (8 	, "VOËLVLEI"), 
    (9 	, "HELY-HUTCHINSON"), 
    (10 , "WOODHEAD"), 
    (11 , "STEENBRAS LOWER"), 
    (12 , "STEENBRAS UPPER"), 
    (13 , "WEMMERSHOEK"), 
    (14 , "VOËLVLEI"), 
    (15 , "HELY-HUTCHINSON"),
    (16 , "WOODHEAD"), 
    (17 , "STEENBRAS LOWER"), 
    (18 , "STEENBRAS UPPER");

 * sqlite:///dam_levels.db
18 rows affected.

[]

Let's check to see if our query worked as expected:

In [18]:
%%sql

SELECT * 
FROM dam_assessments
LIMIT 10; -- Remove this line to see the full query output

 * sqlite:///dam_levels.db
Done.

[(1, 'WEMMERSHOEK'),
 (2, 'VOËLVLEI'),
 (3, 'HELY-HUTCHINSON'),
 (4, 'WOODHEAD'),
 (5, 'STEENBRAS LOWER'),
 (6, 'STEENBRAS UPPER'),
 (7, 'WEMMERSHOEK'),
 (8, 'VOËLVLEI'),
 (9, 'HELY-HUTCHINSON'),
 (10, 'WOODHEAD')]

With all our hard work of preparing the 2NF relations, we can go ahead and delete the now redundant `dam_levels_1nf` table:

In [19]:
%%sql

DROP TABLE dam_levels_1nf;

 * sqlite:///dam_levels.db
Done.

[]

At this point, we have split the *dam_levels_1nf* table into the following tables:

In [20]:
%%sql
SELECT name FROM sqlite_master WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%' ORDER BY 1

 * sqlite:///dam_levels.db
Done.

[('assessments',), ('dam_assessments',), ('dams',)]

Since these tables do are in **1 NF**, and do not have any partial functional dependencies, we have successfully normalised our tables into the second normal form!

### 5.3. Third Normal Form (3 NF)

To get the tables in **3 NF** we need to ensure that:
- 1. The tables are in **2 NF** &#x2611;   
- 2. All transitive dependencies should be removed &#9746; - for 3 NF, non-key fields must provide a fact about the key, the whole key and nothing but the key, anything else should be placed in a separate table. 

Let's take a look at the assessments table:

In [21]:
%%sql

SELECT * 
FROM assessments
LIMIT 10; -- Remove this line to see the full query output

 * sqlite:///dam_levels.db
Done.

[(1, 2012, 'P. M. Naidoo', 201013, 48.2),
 (2, 2012, 'A. T. Sijovu', 202256, 15),
 (3, 2012, 'P. M. Naidoo', 201013, 14.2),
 (4, 2012, 'A. T. Sijovu', 202256, 35.3),
 (5, 2012, 'V. Mokere', 201124, 20.3),
 (6, 2012, 'V. Mokere', 201124, 24.2),
 (7, 2013, 'P. M. Naidoo', 201013, 53.3),
 (8, 2013, 'A. T. Sijovu', 202256, 16.6),
 (9, 2013, 'P. M. Naidoo', 201013, 15.2),
 (10, 2013, 'A. T. Sijovu', 202256, 35.9)]

Evidently, the `year`, `water_level`, and `Assessment_Officer` columns provide a fact about the key (i.e. AssessmentId). However, `Officer_Reg` column only provides information about the `Assessment_Officer` column. As such, let's break down the Assessments table and place all officers in their own separate table.

To do this, let's create a *water_level_assessments* table:

In [22]:
%%sql 

CREATE TABLE water_level_assessments (
    AssessmentId INTEGER PRIMARY KEY AUTOINCREMENT,
    year INTEGER,
    Officer_Reg INTEGER,
    water_level NUMERIC(10,1)
);

 * sqlite:///dam_levels.db
Done.

[]

As an important note, observe that we choose to keep the *Officer_Reg* field within our table instead of *Assessment_Officer*. We do this because the *Officer_Reg* field will need to serve as a [foreign key](https://www.w3schools.com/sql/sql_foreignkey.asp) to a new table we create which will contain all our officer information. Foreign keys are also the primary keys within their respective home tables, and as such need to be unique. In this way, we could have used *Assessment_Officer* as our linking field (foreign key), but we would then run the risk of having two officers with the same name (our key is non-unique) - making our linking relationship invalid. 

With our new table created, let's copy data into the water_level_assessments table:

In [23]:
%%sql

INSERT INTO water_level_assessments(AssessmentId, year, Officer_Reg, water_level)
SELECT AssessmentId, year, Officer_Reg, water_level
FROM assessments
ORDER BY year;

 * sqlite:///dam_levels.db
18 rows affected.

[]

Again, it's a good habit to do a sanity check:

In [24]:
%%sql

SELECT *
FROM water_level_assessments
LIMIT 10; -- Remove this line to see the full query output

 * sqlite:///dam_levels.db
Done.

[(1, 2012, 201013, 48.2),
 (2, 2012, 202256, 15),
 (3, 2012, 201013, 14.2),
 (4, 2012, 202256, 35.3),
 (5, 2012, 201124, 20.3),
 (6, 2012, 201124, 24.2),
 (7, 2013, 201013, 53.3),
 (8, 2013, 202256, 16.6),
 (9, 2013, 201013, 15.2),
 (10, 2013, 202256, 35.9)]

Next, we create an *officers* table to contain the officer data which we removed from the assessments table:

In [25]:
%%sql 

CREATE TABLE officers (
    Officer_Reg INTEGER PRIMARY KEY,
    Officer_Name VARCHAR(100)    
);

 * sqlite:///dam_levels.db
Done.

[]

Next, let's add data into the officers table:

In [26]:
%%sql

INSERT INTO officers(Officer_Name,Officer_Reg)
SELECT Assessment_Officer,Officer_Reg
FROM assessments
GROUP BY Assessment_Officer;

 * sqlite:///dam_levels.db
3 rows affected.

[]

Checking to see if the data was added correctly:

In [27]:
%%sql

SELECT * 
FROM officers;

 * sqlite:///dam_levels.db
Done.

[(201013, 'P. M. Naidoo'), (201124, 'V. Mokere'), (202256, 'A. T. Sijovu')]

The Officer information (i.e. name and registration number) have been correctly captured. Now we can delete the old assessments table:

In [28]:
%%sql

DROP table assessments;

 * sqlite:///dam_levels.db
Done.

[]

With that, we have transformed a table from being unnormalised to the 3rd normal form! We started with a single dam_levels table and ended up with 4 separate table, i.e.:

In [29]:
%%sql

SELECT name FROM sqlite_master WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%' ORDER BY 1

 * sqlite:///dam_levels.db
Done.

[('dam_assessments',), ('dams',), ('officers',), ('water_level_assessments',)]

These tables are in **3 NF** and linked together in a logical way that helps to reduce data anomalies. Although higher levels of normalisation exist, **3 NF** is sufficient for most business applications.

## 6. Denormalization

Denormalisation is the process of producing a lower normal form from a higher normal form. This is sometimes performed on databases because the higher levels of normalization are not always desirable. For example, 4NF; 5NF; 6NF could cause an explosion of tables, which would slow down end-user performance as it would require more relational join operations to perform meaningful queries. However, the performance gain of denormalizing also means that we sacrifice data integrity and put ourselves at risk of data redundancy and other data anomalies.

Like normalization, denormalization is segmented into ordered categories (in reverse order): 4NF, BCNF, 3NF, 2NF and 1NF.
1NF is preferred to 2NF, 2NF to 3NF, etc:

<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/normalisation/denormalisation.png" width=80% align="center"/>


## Conclusion

In this train, we covered different stages in database normalization including the first, second, and third normal forms, explaining each of these in detail and provided a case study where we normalised a database from 1 NF to 3 NF.

## Appendix

The following links may be useful for further learning around the content we've covered: 

 - [Normalization - 1NF, 2NF, 3NF and 4NF](https://www.youtube.com/watch?v=UrYLYV7WSHM)
 - [Normalisation vs Denormalization](https://www.tutorialspoint.com/difference-between-normalization-and-denormalization)